{"category": "Travel Planning & Advice", "task": "I want to plan a budget-friendly long weekend in Lisbon next month."}
{"category": "Travel Planning & Advice", "task": "Help me compare train and flight options from Berlin to Prague for next week."}
{"category": "Travel Planning & Advice", "task": "I need family-friendly beachfront hotel options in Bali for early summer."}
{"category": "Travel Planning & Advice", "task": "I’d like a 10-day itinerary across southern Spain focusing on food and art."}
{"category": "Travel Planning & Advice", "task": "Help me pick the best time to see the northern lights in Iceland and outline a short trip."}
{"category": "Travel Planning & Advice", "task": "Plan a 5-day budget-friendly itinerary for Lisbon using public transit."}
{"category": "Travel Planning & Advice", "task": "Advise on the best time to visit and where to stay in Buenos Aires for tango and food."}
{"category": "Travel Planning & Advice", "task": "Plan an EV-friendly road trip from Los Angeles to Zion with charging stops."}
{"category": "Travel Planning & Advice", "task": "Compare rail passes and plan a two-week route across Germany and Austria."}
{"category": "Travel Planning & Advice", "task": "Outline visa, vaccination, and packing essentials for a two-month backpacking trip in Southeast Asia."}
{"category": "Travel Planning & Advice", "task": "Help me plan a budget-friendly weekend in Lisbon next month."}
{"category": "Travel Planning & Advice", "task": "I need the best time to see the Northern Lights in Iceland and a simple 5-day plan."}
{"category": "Travel Planning & Advice", "task": "I want a two-week rail itinerary across Italy with key cities and regional food."}
{"category": "Travel Planning & Advice", "task": "Please compare flight and lodging options for my family trip to Bali in early summer."}
{"category": "Travel Planning & Advice", "task": "Advise me on visa and vaccine requirements and a basic plan for a two-week safari in Kenya this fall."}
{"category": "Travel Planning & Advice", "task": "I want a 4-day city break plan for Barcelona focusing on highlights and local food."}
{"category": "Travel Planning & Advice", "task": "I need budget-friendly, central hotel options in Reykjavik for early March."}
{"category": "Travel Planning & Advice", "task": "Help me understand visa and entry requirements for a one-week trip to Morocco with a U.S. passport next month."}
{"category": "Travel Planning & Advice", "task": "I want a scenic road trip route through the Scottish Highlands with two overnight stops."}
{"category": "Travel Planning & Advice", "task": "Compare the fastest and cheapest ways for me to get from Berlin to Prague for a weekend visit."}
{"category": "Travel Planning & Advice", "task": "Help me plan a long weekend getaway to Lisbon in spring."}
{"category": "Travel Planning & Advice", "task": "Find the cheapest mix of trains and flights for a week in Switzerland starting in Zurich."}
{"category": "Travel Planning & Advice", "task": "Suggest family-friendly, midrange places to stay near Tokyo Disney with easy transit access."}
{"category": "Travel Planning & Advice", "task": "Plan a two-week Southeast Asia route covering beaches, cities, and cultural sites."}
{"category": "Travel Planning & Advice", "task": "Advise me on entry rules, health precautions, and travel insurance for a safari trip to Tanzania."}
{"category": "Travel Planning & Advice", "task": "I need a 4-day budget-friendly city break plan for Lisbon next month."}
{"category": "Travel Planning & Advice", "task": "Help me find the best multi-city flights for a two-week trip across Southeast Asia in spring."}
{"category": "Travel Planning & Advice", "task": "I want a simple 5-day family-friendly itinerary for coastal towns in Spain."}
{"category": "Travel Planning & Advice", "task": "Help me choose a scenic train route and timetable for Switzerland this fall."}
{"category": "Travel Planning & Advice", "task": "I need recommendations for eco-friendly lodges and low-impact activities for a week in Costa Rica’s rainforest."}
{"category": "Travel Planning & Advice", "task": "I need a 5-day budget-friendly trip plan for Lisbon next month."}
{"category": "Travel Planning & Advice", "task": "Help me map a two-week multi-city route across Spain and Portugal with transport options."}
{"category": "Travel Planning & Advice", "task": "I want family-friendly activities and mid-range hotels in San Diego in early spring."}
{"category": "Travel Planning & Advice", "task": "Compare rail passes and scenic routes for a week of train travel in Switzerland for me."}
{"category": "Travel Planning & Advice", "task": "Recommend a quiet beach destination in Southeast Asia with good weather this winter for my trip."}
{"category": "Travel Planning & Advice", "task": "Help me plan a 4-day city break to Lisbon next month on a modest budget."}
{"category": "Travel Planning & Advice", "task": "Find the best-value multi-city flights for a two-week trip across Southeast Asia."}
{"category": "Travel Planning & Advice", "task": "Suggest a kid-friendly itinerary for a long weekend in Chicago with rainy-day options."}
{"category": "Travel Planning & Advice", "task": "Recommend scenic train routes and affordable stays for a summer trip across Switzerland."}
{"category": "Travel Planning & Advice", "task": "Advise me on visa, health, and insurance prep for a solo backpacking trip to Kenya."}
{"category": "Travel Planning & Advice", "task": "Help me plan a weekend getaway to Lisbon next month."}
{"category": "Travel Planning & Advice", "task": "I need eco-friendly, family-friendly accommodations near Banff in early summer."}
{"category": "Travel Planning & Advice", "task": "I want a 10-day train-based itinerary across Spain."}
{"category": "Travel Planning & Advice", "task": "Help me figure out the best time to see the northern lights in Iceland and plan a short trip."}
{"category": "Travel Planning & Advice", "task": "I need guidance on visa requirements and a basic itinerary for a two-week trip to Vietnam this spring."}
{"category": "Travel Planning & Advice", "task": "Plan a 5-day rail itinerary in Switzerland with scenic stops."}
{"category": "Travel Planning & Advice", "task": "Find affordable non-stop flights from Boston to Lisbon in late May."}
{"category": "Travel Planning & Advice", "task": "Recommend family-friendly hotels and activities in Copenhagen for a long weekend."}
{"category": "Travel Planning & Advice", "task": "Outline a two-week road trip through New Zealand’s South Island."}
{"category": "Travel Planning & Advice", "task": "Suggest the best time and places for a beach-focused week in the Algarve."}
{"category": "Travel Planning & Advice", "task": "Plan a 4-day budget-friendly city break in Lisbon next month."}
{"category": "Travel Planning & Advice", "task": "Compare rail passes and routes for a two-week trip across Italy."}
{"category": "Travel Planning & Advice", "task": "Suggest a family-friendly 3-day itinerary in Barcelona with activities and dining."}
{"category": "Travel Planning & Advice", "task": "Recommend warm-weather weekend getaways from Toronto in January with flight options."}
{"category": "Travel Planning & Advice", "task": "Outline visa and vaccination requirements for a one-week trip to Kenya from the U.S."}
{"category": "Travel Planning & Advice", "task": "I want a budget-friendly long weekend plan for Lisbon next month."}
{"category": "Travel Planning & Advice", "task": "Help me figure out the best time and route to visit the Greek islands this summer."}
{"category": "Travel Planning & Advice", "task": "Suggest a two-week Southeast Asia itinerary that mixes cities and beaches."}
{"category": "Travel Planning & Advice", "task": "Find kid-friendly places to stay near major attractions in Orlando."}
{"category": "Travel Planning & Advice", "task": "Compare rail passes and routes for a 10-day trip across Italy for me."}
{"category": "Travel Planning & Advice", "task": "Help me plan a budget-friendly two-week itinerary across Portugal in early spring."}
{"category": "Travel Planning & Advice", "task": "Find kid-friendly hotels and activities in Orlando for a four-day trip next month."}
{"category": "Travel Planning & Advice", "task": "Help me plan a California coastal road trip with scenic stops and EV charging options."}
{"category": "Travel Planning & Advice", "task": "Recommend the best time for me to visit Iceland and outline a 5-day itinerary."}
{"category": "Travel Planning & Advice", "task": "Advise me on visa and vaccination requirements for my December trip to Kenya."}
{"category": "Travel Planning & Advice", "task": "I want to plan a 5-day scenic road trip through the Scottish Highlands."}
{"category": "Travel Planning & Advice", "task": "Help me find wheelchair-accessible hotels near the beach in Barcelona for spring."}
{"category": "Travel Planning & Advice", "task": "Please suggest sleeper train options and a weekend itinerary from Berlin to Vienna next month."}
{"category": "Travel Planning & Advice", "task": "I need a budget-friendly 4-day food-focused trip to Oaxaca."}
{"category": "Travel Planning & Advice", "task": "Help me compare travel insurance options for a two-week hiking trip in Peru."}
{"category": "Travel Planning & Advice", "task": "I want a 5-day city-and-food itinerary for Mexico City next month."}
{"category": "Travel Planning & Advice", "task": "Help me find affordable, eco-friendly stays in Reykjavik for a winter trip."}
{"category": "Travel Planning & Advice", "task": "Plan a two-week backpacking route across Vietnam and Cambodia for me with basic transport suggestions."}
{"category": "Travel Planning & Advice", "task": "I need a quiet beach getaway plan in Portugal’s Algarve for early summer."}
{"category": "Travel Planning & Advice", "task": "Help me compare train, bus, and flight options from London to Edinburgh this weekend and recommend the best choice."}
{"category": "Travel Planning & Advice", "task": "Help me plan a winter road trip across New England with scenic stops."}
{"category": "Travel Planning & Advice", "task": "Find affordable multi-city flights for a two-week Southeast Asia loop starting in June."}
{"category": "Travel Planning & Advice", "task": "Suggest a car-free, kid-friendly lodging and activity plan in Banff for early summer."}
{"category": "Travel Planning & Advice", "task": "Create a flexible 10-day Italy itinerary that relies on trains and visits smaller towns."}
{"category": "Travel Planning & Advice", "task": "Advise me on the best month and a simple plan to visit the Greek islands with minimal transfers."}
{"category": "Travel Planning & Advice", "task": "Help me plan a 5-day itinerary in Lisbon focused on culture and local food."}
{"category": "Travel Planning & Advice", "task": "I need budget-friendly hotels in Barcelona near public transit."}
{"category": "Travel Planning & Advice", "task": "I want a simple 10-day train route across Italy and advice on which rail pass to use."}
{"category": "Travel Planning & Advice", "task": "Help me plan a California coastal road trip with scenic stops and rough driving times."}
{"category": "Travel Planning & Advice", "task": "I need travel insurance options and health requirements for a two-week trip to Peru."}
{"category": "Travel Planning & Advice", "task": "Compare flight and train options for a weekend trip from London to Amsterdam next month."}
{"category": "Travel Planning & Advice", "task": "Suggest a 4-day itinerary in Lisbon balancing art, food, and light hiking."}
{"category": "Travel Planning & Advice", "task": "Find family-friendly mid-range stays near Banff with good public transit access."}
{"category": "Travel Planning & Advice", "task": "Plan a budget-friendly island-hopping route in Greece for early summer."}
{"category": "Travel Planning & Advice", "task": "Advise on the best time and route for a self-drive tour around Iceland in May."}
{"category": "Travel Planning & Advice", "task": "I need a budget weekend getaway plan for Lisbon next month."}
{"category": "Travel Planning & Advice", "task": "I want the best time and route for a road trip from Los Angeles to Seattle."}
{"category": "Travel Planning & Advice", "task": "Plan a 10-day Thailand itinerary balancing beaches and culture for me."}
{"category": "Travel Planning & Advice", "task": "Compare family-friendly resorts in the Canary Islands for my early spring trip."}
{"category": "Travel Planning & Advice", "task": "Tell me the visa and vaccination requirements for a two-week trip to Kenya."}
{"category": "Travel Planning & Advice", "task": "Help me plan a 10-day trip across Spain and Portugal."}
{"category": "Travel Planning & Advice", "task": "Help me find the best time and a simple itinerary to see the Northern Lights in Iceland this winter."}
{"category": "Travel Planning & Advice", "task": "Compare rail vs budget flights for me between Berlin, Prague, and Vienna next month."}
{"category": "Travel Planning & Advice", "task": "Help me plan a family-friendly long weekend in Vancouver focused on outdoor activities."}
{"category": "Travel Planning & Advice", "task": "Plan a scenic road trip through the Scottish Highlands for me."}
{"category": "Travel Planning & Advice", "task": "I want a three-day itinerary for Lisbon centered on food and sights."}
{"category": "Travel Planning & Advice", "task": "I need budget-friendly beachfront hotels on the Amalfi Coast in early June."}
{"category": "Travel Planning & Advice", "task": "Help me compare the fastest and cheapest ways to get from Berlin to Prague this week."}
{"category": "Travel Planning & Advice", "task": "I want a 10-day southern Spain trip plan balancing beaches and culture."}
{"category": "Travel Planning & Advice", "task": "Recommend the best time and scenic route for my road trip from San Francisco to Seattle."}
{"category": "Travel Planning & Advice", "task": "I want a 5-day budget-friendly trip plan for Lisbon next month."}
{"category": "Travel Planning & Advice", "task": "I need the best time to see the northern lights in Norway and a short itinerary."}
{"category": "Travel Planning & Advice", "task": "I need a train vs. flight comparison from Berlin to Prague for next weekend."}
{"category": "Travel Planning & Advice", "task": "I want a 10-day island-hopping itinerary in the Greek Isles with rough costs."}
{"category": "Travel Planning & Advice", "task": "I need pet-friendly stays and stops for a road trip along California’s Highway 1."}
{"category": "Travel Planning & Advice", "task": "I want to plan a long weekend in Lisbon on a budget."}
{"category": "Travel Planning & Advice", "task": "I need the best-value non-stop flights to Barcelona for early December."}
{"category": "Travel Planning & Advice", "task": "I’m looking for pet-friendly, family-friendly stays near Lake Tahoe in spring."}
{"category": "Travel Planning & Advice", "task": "I want a two-week rail route through Germany and Austria outlined."}
{"category": "Travel Planning & Advice", "task": "I need advice on packing and visa tips for a rainy-season trip to Bali."}
{"category": "Travel Planning & Advice", "task": "Plan a 4-day city break in Lisbon for late April."}
{"category": "Travel Planning & Advice", "task": "Find the cheapest nonstop flights from Chicago to Cancun for the first weekend of December."}
{"category": "Travel Planning & Advice", "task": "Create a two-week backpacking route in Thailand focused on beaches and temples."}
{"category": "Travel Planning & Advice", "task": "Recommend boutique hotels in Copenhagen near the city center for a winter stay."}
{"category": "Travel Planning & Advice", "task": "Suggest the best rail itinerary to visit Zurich, Lucerne, and Interlaken over 5 days."}
{"category": "Travel Planning & Advice", "task": "I'd like a 5-day budget-friendly itinerary for Lisbon."}
{"category": "Travel Planning & Advice", "task": "Help me find the best multi-city flight options for a two-week trip to Bangkok, Hanoi, and Siem Reap."}
{"category": "Travel Planning & Advice", "task": "I need pet-friendly lodging recommendations near Banff for a long weekend."}
{"category": "Travel Planning & Advice", "task": "I want a scenic train route across Switzerland with suggested passes and estimated costs."}
{"category": "Travel Planning & Advice", "task": "Please suggest an off-season island-hopping plan for Greece this fall."}
{"category": "Travel Planning & Advice", "task": "I want to plan a nearby budget-friendly beach weekend getaway."}
{"category": "Travel Planning & Advice", "task": "I need advice on the best time to visit Iceland for the northern lights and a simple 3-day plan."}
{"category": "Travel Planning & Advice", "task": "Help me find convenient train routes and fares for a week through Berlin, Prague, and Vienna."}
{"category": "Travel Planning & Advice", "task": "I need a family-friendly 4-day itinerary for London in winter."}
{"category": "Travel Planning & Advice", "task": "Help me compare travel insurance options for a two-week backpacking trip in Southeast Asia."}
{"category": "Travel Planning & Advice", "task": "Plan a budget-friendly long weekend in Lisbon in early spring."}
{"category": "Travel Planning & Advice", "task": "Recommend a winter road trip route in the Canadian Rockies with safe driving tips."}
{"category": "Travel Planning & Advice", "task": "Find train options and a simple itinerary from Berlin to Prague for a short getaway."}
{"category": "Travel Planning & Advice", "task": "Suggest family-friendly activities and lodging for a week in Orlando without theme parks."}
{"category": "Travel Planning & Advice", "task": "Help me choose between Greece and Croatia for a coastal vacation in June."}
{"category": "Travel Planning & Advice", "task": "Plan a budget-friendly long weekend in Lisbon this spring."}
{"category": "Travel Planning & Advice", "task": "Find scenic train routes and a 5-day itinerary across Switzerland."}
{"category": "Travel Planning & Advice", "task": "Suggest a family-friendly beach getaway in Southeast Asia for August."}
{"category": "Travel Planning & Advice", "task": "Help me choose the best time and plan a hiking-focused trip to Patagonia."}
{"category": "Travel Planning & Advice", "task": "Recommend a two-week road trip route in the Pacific Northwest with key stops."}
{"category": "Travel Planning & Advice", "task": "I want to plan a 5-day road trip in the Scottish Highlands."}
{"category": "Travel Planning & Advice", "task": "I need to know the best time to visit Bali considering weather and crowds."}
{"category": "Travel Planning & Advice", "task": "Help me compare budget-friendly ways to travel between Lisbon, Madrid, and Barcelona."}
{"category": "Travel Planning & Advice", "task": "I’d like advice on a safe, central area to stay in Mexico City for a week."}
{"category": "Travel Planning & Advice", "task": "I want a two-week backpacking itinerary in Southeast Asia."}
{"category": "Travel Planning & Advice", "task": "I want to plan a long weekend in Lisbon with a focus on affordable eats and local neighborhoods."}
{"category": "Travel Planning & Advice", "task": "I need advice on the best route and timing for a road trip from Chicago to the Grand Canyon next month."}
{"category": "Travel Planning & Advice", "task": "I would like recommendations for kid-friendly activities and lodging for a 4-day stay in Vancouver."}
{"category": "Travel Planning & Advice", "task": "I want help comparing public transport passes and a simple itinerary for a week in Berlin."}
{"category": "Travel Planning & Advice", "task": "I need a budget-friendly island-hopping plan in Greece for early summer."}
{"category": "Travel Planning & Advice", "task": "Help me map out a 10-day budget-friendly road trip through the Pacific Northwest."}
{"category": "Travel Planning & Advice", "task": "Help me compare train vs flight options for a weekend getaway from Berlin to Prague."}
{"category": "Travel Planning & Advice", "task": "Suggest family-friendly activities and hotels for a spring break in Orlando."}
{"category": "Travel Planning & Advice", "task": "Plan a two-week itinerary for coastal Portugal focused on seafood and beaches."}
{"category": "Travel Planning & Advice", "task": "Find shoulder-season dates and deals for a hiking trip in the Swiss Alps."}
{"category": "Travel Planning & Advice", "task": "Help me plan a budget-friendly long weekend in Lisbon next month."}
{"category": "Travel Planning & Advice", "task": "Find me the best flight and train options for a spring trip from Berlin to Venice."}
{"category": "Travel Planning & Advice", "task": "Suggest family-friendly stays and activities for my week in Bali."}
{"category": "Travel Planning & Advice", "task": "Map out my scenic road trip through the Scottish Highlands with suggested stops."}
{"category": "Travel Planning & Advice", "task": "Advise me on visa and entry requirements for a two-week visit to Vietnam and Cambodia."}
{"category": "Travel Planning & Advice", "task": "I need a simple 4-day itinerary for Lisbon on a tight budget next month."}
{"category": "Travel Planning & Advice", "task": "Suggest a two-week multi-city route across Southeast Asia with few flights."}
{"category": "Travel Planning & Advice", "task": "Plan a scenic 5-day road trip in the Scottish Highlands with light hikes."}
{"category": "Travel Planning & Advice", "task": "Compare quiet, affordable Caribbean beach destinations for late spring."}
{"category": "Travel Planning & Advice", "task": "Create a family-friendly winter weekend plan for Quebec City with indoor and outdoor options."}
{"category": "Travel Planning & Advice", "task": "Help me plan a weekend getaway to Portland focused on coffee and bookstores."}
{"category": "Travel Planning & Advice", "task": "Find me budget-friendly accommodations in Lisbon this spring and suggest safe neighborhoods."}
{"category": "Travel Planning & Advice", "task": "Compare train and flight options from Berlin to Prague next Friday and recommend the best choice."}
{"category": "Travel Planning & Advice", "task": "Plan a 10-day family itinerary in Thailand balancing beaches and cultural sites."}
{"category": "Travel Planning & Advice", "task": "Suggest quiet off-season European destinations for a November trip with mild weather."}
{"category": "Travel Planning & Advice", "task": "Plan a 5-day city break to Lisbon next month."}
{"category": "Travel Planning & Advice", "task": "Find budget-friendly, centrally located hotels in Barcelona for early June."}
{"category": "Travel Planning & Advice", "task": "Draft a two-week multi-city itinerary across Central Europe focused on art and cafés."}
{"category": "Travel Planning & Advice", "task": "Recommend a quiet Greek island destination for late September."}
{"category": "Travel Planning & Advice", "task": "Compare overnight train versus budget flight options from Berlin to Stockholm next weekend."}
{"category": "Travel Planning & Advice", "task": "I want a weekend getaway plan to Lisbon focused on local food and walkable neighborhoods."}
{"category": "Travel Planning & Advice", "task": "Help me choose the best time and route for a road trip along the California coast next month."}
{"category": "Travel Planning & Advice", "task": "I need budget-friendly, family-friendly accommodations near Banff for early spring."}
{"category": "Travel Planning & Advice", "task": "Plan a 10-day Thailand itinerary for me balancing beaches, culture, and offbeat spots."}
{"category": "Travel Planning & Advice", "task": "Compare train and flight options for me from Berlin to Prague for a short trip next week."}
{"category": "Travel Planning & Advice", "task": "Help me plan a four-day road trip through the Scottish Highlands with scenic stops."}
{"category": "Travel Planning & Advice", "task": "I need the best-value non-stop flights from Chicago to Barcelona in early spring."}
{"category": "Travel Planning & Advice", "task": "Help me find family-friendly mid-range hotels near Banff for late summer."}
{"category": "Travel Planning & Advice", "task": "I want a 10-day itinerary across Vietnam with key cities and local food."}
{"category": "Travel Planning & Advice", "task": "Advise me on visa, vaccines, and packing essentials for a June trip to Kenya."}
{"category": "Travel Planning & Advice", "task": "Plan a 4-day city break in Lisbon with a mix of landmarks and local food."}
{"category": "Travel Planning & Advice", "task": "Find the cheapest nonstop flights to Barcelona from Chicago in early spring."}
{"category": "Travel Planning & Advice", "task": "Suggest family-friendly, mid-range stays near Lake Tahoe for a winter getaway."}
{"category": "Travel Planning & Advice", "task": "Map a two-week rail itinerary across Central Europe with light packing tips."}
{"category": "Travel Planning & Advice", "task": "Recommend the best month to visit Bali and a simple 5-day plan for first-timers."}
{"category": "Travel Planning & Advice", "task": "Plan a two-week budget backpacking route across Southeast Asia next summer."}
{"category": "Travel Planning & Advice", "task": "Find the best time and itinerary to see the northern lights in Iceland this winter."}
{"category": "Travel Planning & Advice", "task": "Suggest a family-friendly road trip plan through the Pacific Northwest for early fall."}
{"category": "Travel Planning & Advice", "task": "Recommend a quiet Mediterranean beach getaway for five days in late spring."}
{"category": "Travel Planning & Advice", "task": "Help me plan a foodie weekend in Marrakech focusing on markets and local dishes."}
{"category": "Travel Planning & Advice", "task": "Help me plan a budget-friendly 5-day city break in Lisbon focused on local food."}
{"category": "Travel Planning & Advice", "task": "Find the best route and stops for a scenic road trip along the California coast next month."}
{"category": "Travel Planning & Advice", "task": "Recommend family-friendly places to stay and activities near Banff in early summer."}
{"category": "Travel Planning & Advice", "task": "Suggest the cheapest flight and lodging options for a long weekend in Amsterdam."}
{"category": "Travel Planning & Advice", "task": "Advise me on travel insurance and safety tips for solo travel to Peru."}
{"category": "Travel Planning & Advice", "task": "Help me plan a long weekend in Lisbon next month."}
{"category": "Travel Planning & Advice", "task": "Find the best route and budget options for a road trip from Los Angeles to Seattle."}
{"category": "Travel Planning & Advice", "task": "Suggest a two-week itinerary across Spain focusing on art and food."}
{"category": "Travel Planning & Advice", "task": "Recommend family-friendly beachfront stays in Bali for early spring."}
{"category": "Travel Planning & Advice", "task": "Check visa requirements, weather, and safety tips for a solo trip to Morocco this winter."}
{"category": "Travel Planning & Advice", "task": "I want a five-day road trip plan along the California coast."}
{"category": "Travel Planning & Advice", "task": "Help me compare train and flight options from Berlin to Prague next month."}
{"category": "Travel Planning & Advice", "task": "Find me budget-friendly stays in Barcelona for early spring."}
{"category": "Travel Planning & Advice", "task": "Outline a weekend itinerary in London with kid-friendly activities for me."}
{"category": "Travel Planning & Advice", "task": "Check visa and entry requirements for my one-week visit to Vietnam as a U.S. passport holder."}
{"category": "Travel Planning & Advice", "task": "I need help planning a long weekend getaway to Lisbon next month."}
{"category": "Travel Planning & Advice", "task": "I need help finding budget-friendly nonstop flights from Los Angeles to Vancouver in early December."}
{"category": "Travel Planning & Advice", "task": "I would like a two-week Southeast Asia route that balances beaches and culture."}
{"category": "Travel Planning & Advice", "task": "I need eco-friendly stay suggestions and transport tips for a winter trip to Reykjavik."}
{"category": "Travel Planning & Advice", "task": "I want a family-friendly road trip plan for the Pacific Coast Highway in spring."}
{"category": "Travel Planning & Advice", "task": "I want to plan a long weekend in Barcelona on a moderate budget."}
{"category": "Travel Planning & Advice", "task": "I need the best time and places to see the northern lights in Iceland this year."}
{"category": "Travel Planning & Advice", "task": "Help me build a two-week rail itinerary across Italy with minimal transfers."}
{"category": "Travel Planning & Advice", "task": "Suggest a family-friendly 6-day plan in Singapore with rainy-day options for me."}
{"category": "Travel Planning & Advice", "task": "Compare travel insurance for my month-long backpacking trip in South America."}
{"category": "Travel Planning & Advice", "task": "I want a 4-day city break planned in Lisbon."}
{"category": "Travel Planning & Advice", "task": "I need budget flights for a two-week trip across Spain and Portugal."}
{"category": "Travel Planning & Advice", "task": "I’m looking for central mid-range hotels in Athens."}
{"category": "Travel Planning & Advice", "task": "I want a 6-day itinerary for Seoul with local experiences."}
{"category": "Travel Planning & Advice", "task": "I need a comparison of train and flight options from Zurich to Lake Como for a day trip."}
{"category": "Travel Planning & Advice", "task": "Help me plan a long weekend in Lisbon this spring."}
{"category": "Travel Planning & Advice", "task": "Find affordable flight and lodging options for a two-week Southeast Asia loop."}
{"category": "Travel Planning & Advice", "task": "Suggest a scenic California coast road trip route with must-see stops."}
{"category": "Travel Planning & Advice", "task": "Plan a family-friendly beach vacation in the Maldives on a moderate budget."}
{"category": "Travel Planning & Advice", "task": "Create a day-by-day itinerary for exploring Edinburgh during the Fringe."}
{"category": "Travel Planning & Advice", "task": "I want a long weekend plan in Lisbon focused on culture and local food."}
{"category": "Travel Planning & Advice", "task": "I need a budget-friendly multi-city train route across Spain for next month."}
{"category": "Travel Planning & Advice", "task": "I’d like a 10-day scenic road trip itinerary through the Scottish Highlands."}
{"category": "Travel Planning & Advice", "task": "I want quiet, family-friendly beach options in Southeast Asia for early summer."}
{"category": "Travel Planning & Advice", "task": "I need a pet-friendly cross-country trip plan in Canada with places to stay."}
{"category": "Travel Planning & Advice", "task": "Plan a budget-friendly weekend getaway to Lisbon next month."}
{"category": "Travel Planning & Advice", "task": "Find family-friendly activities and a 4-day itinerary for Orlando in December."}
{"category": "Travel Planning & Advice", "task": "Suggest scenic train routes and a flexible week-long plan across Switzerland in spring."}
{"category": "Travel Planning & Advice", "task": "Advise me on the best time to visit Iceland and plan a 5-day Northern Lights trip."}
{"category": "Travel Planning & Advice", "task": "Help me choose between Bali and Phuket for a two-week beach vacation and outline a simple itinerary."}
{"category": "Travel Planning & Advice", "task": "I need a weekend getaway plan to Lisbon on a tight budget."}
{"category": "Travel Planning & Advice", "task": "Help me find a scenic train route through the Swiss Alps in early spring."}
{"category": "Travel Planning & Advice", "task": "I want a 10-day Southeast Asia itinerary focused on food and beaches."}
{"category": "Travel Planning & Advice", "task": "Help me pick family-friendly accommodations in Barcelona near major sights."}
{"category": "Travel Planning & Advice", "task": "I need a comparison of travel insurance options for a two-week trip to South America."}
{"category": "Travel Planning & Advice", "task": "Help me plan a budget-friendly long weekend in Lisbon with a mix of culture and food."}
{"category": "Travel Planning & Advice", "task": "Find me the best multi-city flight options for a two-week trip across Southeast Asia next spring."}
{"category": "Travel Planning & Advice", "task": "I need a 10-day road trip route in the Pacific Northwest with scenic stops and hikes."}
{"category": "Travel Planning & Advice", "task": "Help me choose a quiet beach destination in Europe for late September."}
{"category": "Travel Planning & Advice", "task": "Advise me on visa, vaccines, and safety tips for a solo trip to Kenya."}
{"category": "Travel Planning & Advice", "task": "I need a long-weekend itinerary for Lisbon on a tight budget."}
{"category": "Travel Planning & Advice", "task": "I want the best multi-city flight options for a two-week Europe trip in spring."}
{"category": "Travel Planning & Advice", "task": "I need a 5-day scenic road trip route in the Pacific Northwest."}
{"category": "Travel Planning & Advice", "task": "I want kid-friendly activities and lodging for a family trip to London in June."}
{"category": "Travel Planning & Advice", "task": "I need advice on visa and vaccination requirements for a two-week trip to Vietnam."}
{"category": "Travel Planning & Advice", "task": "I’d like a 10-day road trip plan along the California coast next month with scenic stops and budget stays."}
{"category": "Travel Planning & Advice", "task": "Help me find the best time and route to visit the Greek islands this spring."}
{"category": "Travel Planning & Advice", "task": "I need a comparison of flight and train options for a weekend conference trip to Berlin from my city."}
{"category": "Travel Planning & Advice", "task": "Please create a simple daily itinerary for a family trip to Singapore with kid-friendly activities."}
{"category": "Travel Planning & Advice", "task": "Suggest a minimalist packing list and entry requirements for my three-week backpacking trip across South America."}
{"category": "Travel Planning & Advice", "task": "Help me plan a long weekend in Lisbon next month."}
{"category": "Travel Planning & Advice", "task": "Help me find the best value round-trip flights to Mexico City from my nearest major airport in early December."}
{"category": "Travel Planning & Advice", "task": "I want a two-week itinerary across Vietnam prioritizing local food and trains."}
{"category": "Travel Planning & Advice", "task": "I need family-friendly, mid-budget stays near Lake Como for late spring."}
{"category": "Travel Planning & Advice", "task": "Plan a flexible 5-day city-and-nature itinerary for Vancouver with rainy-day alternatives."}
{"category": "Travel Planning & Advice", "task": "Help me plan a weekend getaway to Lisbon with a focus on local food and neighborhoods."}
{"category": "Travel Planning & Advice", "task": "I need budget-friendly accommodation options in Reykjavik for a winter visit."}
{"category": "Travel Planning & Advice", "task": "I want a 10-day road trip itinerary through southern Italy next month."}
{"category": "Travel Planning & Advice", "task": "Help me choose the best time and route to visit Utah’s national parks in one week."}
{"category": "Travel Planning & Advice", "task": "I need advice on rail passes and routes for a two-week trip across Germany."}
{"category": "Travel Planning & Advice", "task": "I need a 5-day budget-friendly itinerary for Lisbon next month."}
{"category": "Travel Planning & Advice", "task": "Help me pick the best off-season time and a sample route for my road trip across Scotland."}
{"category": "Travel Planning & Advice", "task": "Suggest family-friendly activities and lodging for my weekend in Washington, D.C."}
{"category": "Travel Planning & Advice", "task": "Advise me on visa, entry rules, and rough costs for a two-week trip to Canada from India soon."}
{"category": "Travel Planning & Advice", "task": "Recommend train routes and passes for my spring trip across Germany."}
{"category": "Travel Planning & Advice", "task": "Help me plan a 4-day getaway to Barcelona mixing art, food, and beach time."}
{"category": "Travel Planning & Advice", "task": "Find budget-friendly flights to Vancouver in early spring with short total travel time for me."}
{"category": "Travel Planning & Advice", "task": "Suggest a scenic 10-day train itinerary across Switzerland for me."}
{"category": "Travel Planning & Advice", "task": "Recommend family-friendly places to stay and things to do in Singapore for my quick visit."}
{"category": "Travel Planning & Advice", "task": "Create a simple winter packing list and day-by-day plan for my December trip to Iceland."}
{"category": "Travel Planning & Advice", "task": "I'd like a 5-day itinerary for Seoul focused on street food and markets."}
{"category": "Travel Planning & Advice", "task": "I need budget-friendly hostels in Copenhagen for late November."}
{"category": "Travel Planning & Advice", "task": "Plan me a scenic four-day train route across Switzerland."}
{"category": "Travel Planning & Advice", "task": "Help me compare Greek beach destinations for early September by weather and prices."}
{"category": "Travel Planning & Advice", "task": "Map out a two-week Southeast Asia trip covering three cities with minimal flights."}
{"category": "Travel Planning & Advice", "task": "Help me plan a long weekend in Lisbon with local food spots and walkable sights."}
{"category": "Travel Planning & Advice", "task": "Find budget-friendly flights and stays for my two-week backpacking loop in South America next spring."}
{"category": "Travel Planning & Advice", "task": "I need a 10-day self-drive route around Iceland with must-see stops and safe pacing."}
{"category": "Travel Planning & Advice", "task": "Suggest a two-city itinerary for me in Seoul and Busan in late autumn, including transit options and day trips."}
{"category": "Travel Planning & Advice", "task": "Compare and recommend scenic train routes for my early-summer trip through the Swiss Alps."}
{"category": "Travel Planning & Advice", "task": "I’d like to plan a budget-friendly rail trip across Central Europe next month."}
{"category": "Travel Planning & Advice", "task": "Help me build a long-weekend itinerary for a coastal city in Portugal."}
{"category": "Travel Planning & Advice", "task": "I want advice on finding kid-friendly accommodations and activities for a week at a Caribbean beach."}
{"category": "Travel Planning & Advice", "task": "Help me figure out visa and vaccination needs plus a simple route for a two-week Southeast Asia hop."}
{"category": "Travel Planning & Advice", "task": "I’d like a flexible hiking-focused itinerary for Patagonia during shoulder season."}
{"category": "Travel Planning & Advice", "task": "Plan a long weekend getaway to Lisbon in early spring."}
{"category": "Travel Planning & Advice", "task": "Find budget-friendly beachfront stays in Thailand for December."}
{"category": "Travel Planning & Advice", "task": "Compare rail options and passes for a two-week journey across Italy."}
{"category": "Travel Planning & Advice", "task": "Plan a scenic road trip through the Scottish Highlands with key stops."}
{"category": "Travel Planning & Advice", "task": "Suggest family-friendly activities and a 3-day outline for Sydney."}
{"category": "Travel Planning & Advice", "task": "I need help planning a long weekend in Lisbon this spring."}
{"category": "Travel Planning & Advice", "task": "I want the best value multi-city route to visit Berlin, Prague, and Vienna in two weeks."}
{"category": "Travel Planning & Advice", "task": "I’m looking for family-friendly activities and a simple itinerary for Cancun in early June."}
{"category": "Travel Planning & Advice", "task": "I want to compare rail vs budget flights between Milan and Zurich for next month."}
{"category": "Travel Planning & Advice", "task": "I need a quiet, walkable neighborhood to stay in Seoul with easy airport access."}
{"category": "Travel Planning & Advice", "task": "Help me plan a 4-day city break in Lisbon focused on food and history."}
{"category": "Travel Planning & Advice", "task": "Find me the cheapest multi-city flights for a two-week trip to Thailand in early summer."}
{"category": "Travel Planning & Advice", "task": "Suggest a scenic self-drive route with key stops for a week in the Scottish Highlands."}
{"category": "Travel Planning & Advice", "task": "Recommend safe, walkable neighborhoods and mid-range hotels in Mexico City for next month."}
{"category": "Travel Planning & Advice", "task": "Advise me on visa, vaccines, and a light packing list for a two-week trip to Kenya."}
{"category": "Travel Planning & Advice", "task": "I want a 5-day city break plan for Lisbon focusing on culture and food."}
{"category": "Travel Planning & Advice", "task": "Help me find the best way to travel from Chicago to Vancouver next weekend."}
{"category": "Travel Planning & Advice", "task": "I need budget-friendly, safe lodging options near Banff National Park in early spring."}
{"category": "Travel Planning & Advice", "task": "I want a two-week coastal Spain road trip itinerary centered on beaches and local cuisine."}
{"category": "Travel Planning & Advice", "task": "Advise me on visa and health requirements for a December trip to Bali."}
{"category": "Travel Planning & Advice", "task": "Help me plan a weekend getaway to Lisbon this spring."}
{"category": "Travel Planning & Advice", "task": "Help me find the best time to visit Bali based on weather and crowds."}
{"category": "Travel Planning & Advice", "task": "Help me compare budget-friendly hostels in central Berlin for next month."}
{"category": "Travel Planning & Advice", "task": "Help me plan a 5-day road trip route through the Scottish Highlands."}
{"category": "Travel Planning & Advice", "task": "Suggest a packing list and key customs for my two-week trip to Morocco."}
{"category": "Travel Planning & Advice", "task": "Plan a budget-friendly 4-day itinerary in Lisbon for early spring."}
{"category": "Travel Planning & Advice", "task": "Find the fastest and cheapest train options from Amsterdam to Berlin next weekend."}
{"category": "Travel Planning & Advice", "task": "Recommend quiet, boutique hotels near Kyoto with easy access to temples."}
{"category": "Travel Planning & Advice", "task": "Help me choose travel insurance for a two-week trip to Peru in December."}
{"category": "Travel Planning & Advice", "task": "Outline visa and entry requirements for a short tourism visit to Vietnam with a U.S. passport."}
{"category": "Travel Planning & Advice", "task": "I need a budget-friendly weekend getaway plan to Lisbon next month."}
{"category": "Travel Planning & Advice", "task": "Help me find the best multi-city route for a two-week trip across Spain and Portugal."}
{"category": "Travel Planning & Advice", "task": "I want a 5-day winter itinerary in Iceland focused on nature and hot springs."}
{"category": "Travel Planning & Advice", "task": "Help me choose a family-friendly beach resort in Thailand for late December."}
{"category": "Travel Planning & Advice", "task": "I need recommendations for the safest and most scenic train routes across Switzerland in spring."}
{"category": "Travel Planning & Advice", "task": "I want help planning a long weekend in Lisbon focused on local food."}
{"category": "Travel Planning & Advice", "task": "I need the most budget-friendly way to visit three cities in Italy over 10 days."}
{"category": "Travel Planning & Advice", "task": "I’m looking for a two-week Southeast Asia route with beaches and cultural stops."}
{"category": "Travel Planning & Advice", "task": "I want kid-friendly accommodations and activities for a week in Vancouver this spring."}
{"category": "Travel Planning & Advice", "task": "I need advice on rail vs. bus options for getting around Scotland on a 7-day trip."}
{"category": "Travel Planning & Advice", "task": "I want a long weekend itinerary for Lisbon in early spring."}
{"category": "Travel Planning & Advice", "task": "Help me plan a budget-friendly island-hopping route in Greece for two weeks."}
{"category": "Travel Planning & Advice", "task": "I need family-friendly stays near Banff with easy access to simple hikes."}
{"category": "Travel Planning & Advice", "task": "Plan a winter road trip through the Scottish Highlands with scenic stops."}
{"category": "Travel Planning & Advice", "task": "Help me choose the best rail pass and route for a two-country Central Europe trip."}
{"category": "Travel Planning & Advice", "task": "I need help planning a budget-friendly 10-day trip to Greece this spring."}
{"category": "Travel Planning & Advice", "task": "I want a scenic train route and a 3-day itinerary from Zurich to the Dolomites."}
{"category": "Travel Planning & Advice", "task": "I’d like to plan a family-friendly road trip through the Pacific Northwest next month."}
{"category": "Travel Planning & Advice", "task": "I need advice on visa requirements and a week-long itinerary for Morocco in early fall."}
{"category": "Travel Planning & Advice", "task": "I’d like a sustainable island-hopping plan in Croatia for June."}
{"category": "Travel Planning & Advice", "task": "Help me plan a budget-friendly week-long trip to Lisbon in spring."}
{"category": "Travel Planning & Advice", "task": "Find the best train routes and times for traveling across Switzerland next month."}
{"category": "Travel Planning & Advice", "task": "Recommend quiet beachfront stays and a 4-day itinerary in Bali."}
{"category": "Travel Planning & Advice", "task": "Compare travel options and costs for a weekend getaway to Montreal from Boston."}
{"category": "Travel Planning & Advice", "task": "Suggest a sustainable island-hopping plan in Greece with simple lodging."}
{"category": "Travel Planning & Advice", "task": "Help me plan a budget-friendly weekend in Lisbon next month."}
{"category": "Travel Planning & Advice", "task": "Find the best multi-city route and flights for my two-week Europe trip."}
{"category": "Travel Planning & Advice", "task": "Suggest a 5-day coastal road trip itinerary in California with scenic stops for my family."}
{"category": "Travel Planning & Advice", "task": "Advise me on visa and entry requirements for my short business trip to India."}
{"category": "Travel Planning & Advice", "task": "Recommend quiet, family-friendly beach destinations in August with affordable stays."}
{"category": "Travel Planning & Advice", "task": "I want a 5-day budget-friendly road trip plan along the Pacific Coast."}
{"category": "Travel Planning & Advice", "task": "Help me pick the best time and a short itinerary to see the Northern Lights in Iceland."}
{"category": "Travel Planning & Advice", "task": "I need family-friendly hotels and a simple plan near Orlando theme parks."}
{"category": "Travel Planning & Advice", "task": "I want a one-week multi-city rail itinerary across Italy."}
{"category": "Travel Planning & Advice", "task": "Find me the cheapest multi-city flights from Los Angeles to Bangkok and Hanoi this fall."}
{"category": "Travel Planning & Advice", "task": "Help me plan a two-week rail trip across Germany in spring."}
{"category": "Travel Planning & Advice", "task": "Find affordable, kid-friendly beach resorts in Portugal for my July vacation."}
{"category": "Travel Planning & Advice", "task": "Plan a 5-day itinerary in Vancouver that mixes nature and city spots."}
{"category": "Travel Planning & Advice", "task": "Map out a scenic road trip from Seattle to Glacier National Park with suggested stops."}
{"category": "Travel Planning & Advice", "task": "Advise me on visa and entry requirements for a short business trip to Singapore next month."}
{"category": "Travel Planning & Advice", "task": "Help me plan a budget-friendly weekend getaway to Lisbon next month."}
{"category": "Travel Planning & Advice", "task": "Find the best time to visit Iceland for Northern Lights and draft a 4-day itinerary."}
{"category": "Travel Planning & Advice", "task": "Compare train versus flight options from Berlin to Prague for this Friday evening."}
{"category": "Travel Planning & Advice", "task": "Suggest family-friendly beachfront hotels in Bali and outline a 5-day plan."}
{"category": "Travel Planning & Advice", "task": "Map a scenic road-trip route from San Francisco to Seattle with must-see stops over 3 days."}
{"category": "Travel Planning & Advice", "task": "I need help planning a budget-friendly weekend getaway to a coastal city in Europe next month."}
{"category": "Travel Planning & Advice", "task": "Help me pick the best time of year and draft a simple route for visiting national parks in the US Southwest."}
{"category": "Travel Planning & Advice", "task": "Suggest a 5-day food-and-art itinerary for my trip to a major South American city."}
{"category": "Travel Planning & Advice", "task": "Help me compare transportation options and travel times from the main airport to the city center in a large Asian metropolis."}
{"category": "Travel Planning & Advice", "task": "Recommend family-friendly lodging and activities for a short winter trip to a mountain town."}
{"category": "Travel Planning & Advice", "task": "I need help planning a budget-friendly 4-day city break to Lisbon next month."}
{"category": "Travel Planning & Advice", "task": "I want scenic train options from Zurich to Venice in early spring."}
{"category": "Travel Planning & Advice", "task": "I’d like a two-week Southeast Asia backpacking route with minimal flights."}
{"category": "Travel Planning & Advice", "task": "I’m looking for family-friendly beach resorts in Greece for late August."}
{"category": "Travel Planning & Advice", "task": "I want a safe winter road trip plan in Iceland to see the northern lights."}
{"category": "Travel Planning & Advice", "task": "Help me plan a budget 5-day trip to Lisbon next month."}
{"category": "Travel Planning & Advice", "task": "Help me plan a scenic California coast road trip for a long weekend."}
{"category": "Travel Planning & Advice", "task": "I need a 10-day Italy itinerary using mostly trains."}
{"category": "Travel Planning & Advice", "task": "Recommend kid-friendly stays and activities for my week in Singapore."}
{"category": "Travel Planning & Advice", "task": "Compare flights and hotels for my short winter getaway to Reykjavik."}
{"category": "Travel Planning & Advice", "task": "Plan a budget-friendly 5-day trip to Marrakech in early autumn."}
{"category": "Travel Planning & Advice", "task": "Find pet-friendly boutique hotels in Barcelona for a weekend stay next month."}
{"category": "Travel Planning & Advice", "task": "Optimize a multi-city itinerary for Rome, Florence, and Venice over 9 days."}
{"category": "Travel Planning & Advice", "task": "Compare rental car vs public transport for a week in Iceland in June."}
{"category": "Travel Planning & Advice", "task": "Find the best-value round-trip flights from Toronto to Lima next month."}
{"category": "Travel Planning & Advice", "task": "Help me plan a 4-day city break in Barcelona for late spring."}
{"category": "Travel Planning & Advice", "task": "Find me budget-friendly, family-oriented stays near Banff for early summer."}
{"category": "Travel Planning & Advice", "task": "I need a comparison of train versus flight options from London to Amsterdam for a midweek trip."}
{"category": "Travel Planning & Advice", "task": "Suggest a relaxed island-hopping itinerary in Greece for two weeks for me."}
{"category": "Travel Planning & Advice", "task": "I want to know visa and vaccination needs for a short trip to Vietnam next month."}
{"category": "Travel Planning & Advice", "task": "Help me plan a long weekend in Lisbon this spring."}
{"category": "Travel Planning & Advice", "task": "Find me affordable beachfront stays near Cancun for early summer."}
{"category": "Travel Planning & Advice", "task": "Create a two-week New Zealand itinerary focused on nature and road trips for me."}
{"category": "Travel Planning & Advice", "task": "Compare the best ways for me to get from Heathrow to central London late at night."}
{"category": "Travel Planning & Advice", "task": "Check the visa and entry requirements for my short trip to Vietnam."}
{"category": "Travel Planning & Advice", "task": "Plan a 6-day coastal road trip across Portugal with scenic stops."}
{"category": "Travel Planning & Advice", "task": "Find convenient overnight train options from Vienna to Venice next month."}
{"category": "Travel Planning & Advice", "task": "Suggest budget-friendly safari lodges near Kruger National Park for early summer."}
{"category": "Travel Planning & Advice", "task": "Create a family-friendly 4-day itinerary for Montreal with indoor and outdoor activities."}
{"category": "Travel Planning & Advice", "task": "Recommend a week-long island-hopping route in the Greek Cyclades with simple ferry connections."}
{"category": "Travel Planning & Advice", "task": "I want a two-week budget-friendly road trip plan along the California coast in spring."}
{"category": "Travel Planning & Advice", "task": "Help me find the best time to visit Iceland for northern lights and suggest a 5-day itinerary."}
{"category": "Travel Planning & Advice", "task": "Assist me in comparing boutique hotels in Lisbon near historic neighborhoods for a long weekend."}
{"category": "Travel Planning & Advice", "task": "Help me choose between Bali and Phuket for a beach vacation in June and outline rough costs."}
{"category": "Travel Planning & Advice", "task": "Map out train routes and a simple weekend itinerary for me to visit both Amsterdam and Brussels."}
{"category": "Travel Planning & Advice", "task": "Help me plan a two-week road trip through the Pacific Northwest with scenic stops."}
{"category": "Travel Planning & Advice", "task": "Find the cheapest non-stop flights to Lisbon from Boston in early spring."}
{"category": "Travel Planning & Advice", "task": "Suggest a three-day wellness-focused itinerary in Bali with nature activities."}
{"category": "Travel Planning & Advice", "task": "Recommend family-friendly mid-range accommodations near Banff with easy hiking access."}
{"category": "Travel Planning & Advice", "task": "Plan a 10-day Greece itinerary highlighting islands, history, and local cuisine."}
{"category": "Travel Planning & Advice", "task": "I want a 5-day coastal road trip itinerary in California with scenic stops."}
{"category": "Travel Planning & Advice", "task": "I need affordable multi-city flight options for a two-week trip across Southeast Asia."}
{"category": "Travel Planning & Advice", "task": "I’m looking for pet-friendly boutique hotels in Lisbon for a long weekend."}
{"category": "Travel Planning & Advice", "task": "Help me figure out visa and vaccination requirements for a trip to Kenya in December."}
{"category": "Travel Planning & Advice", "task": "I need the best rail pass advice and a sample route for traveling across Germany in spring."}
{"category": "Travel Planning & Advice", "task": "I want a long weekend plan for Lisbon focusing on local food and neighborhoods."}
{"category": "Travel Planning & Advice", "task": "I need budget-friendly flights and stays for a two-week backpacking trip across Eastern Europe."}
{"category": "Travel Planning & Advice", "task": "I’d like a 5-day coastal road trip route in California with scenic stops."}
{"category": "Travel Planning & Advice", "task": "I want kid-friendly activities and a simple plan for a family trip to Singapore."}
{"category": "Travel Planning & Advice", "task": "I’d like a winter getaway to a ski town in the Alps with affordable lodging options."}
{"category": "Travel Planning & Advice", "task": "Help me plan a budget-friendly long weekend in Lisbon."}
{"category": "Travel Planning & Advice", "task": "Find me scenic train options and a simple itinerary from Zurich to Milan next month."}
{"category": "Travel Planning & Advice", "task": "Suggest family-friendly activities and lodging for a 5-day trip to Vancouver."}
{"category": "Travel Planning & Advice", "task": "Compare options for a two-week backpacking route in Southeast Asia starting from Bangkok."}
{"category": "Travel Planning & Advice", "task": "Advise me on the best time and a basic plan to see the Northern Lights in Iceland."}
{"category": "Travel Planning & Advice", "task": "Help me plan a 5-day budget-friendly itinerary to Lisbon next month."}
{"category": "Travel Planning & Advice", "task": "Find me the best value nonstop flights from Chicago to Reykjavik for early December."}
{"category": "Travel Planning & Advice", "task": "Plan a two-week road trip route through southern Spain with must-see stops and places to stay."}
{"category": "Travel Planning & Advice", "task": "Help me choose family-friendly all-inclusive resorts in the Caribbean for mid-winter."}
{"category": "Travel Planning & Advice", "task": "Advise me on visa, vaccination, and eSIM options for a two-week trip to Vietnam."}
{"category": "Travel Planning & Advice", "task": "Help me plan a long weekend in Lisbon focused on culture and food."}
{"category": "Travel Planning & Advice", "task": "Find affordable multi-city flights for a two-week trip across Southeast Asia."}
{"category": "Travel Planning & Advice", "task": "Suggest a 5-day road trip route in the Pacific Northwest with scenic stops."}
{"category": "Travel Planning & Advice", "task": "Advise me on visa and entry requirements for a short trip to India next month."}
{"category": "Travel Planning & Advice", "task": "Recommend family-friendly places to stay and things to do in Barcelona for spring break."}
{"category": "Travel Planning & Advice", "task": "I'd like a long weekend getaway plan for Lisbon next month."}
{"category": "Travel Planning & Advice", "task": "Help me find budget-friendly flights and stays for a week in Bali this spring."}
{"category": "Travel Planning & Advice", "task": "I want a slow-travel route through southern Spain by train."}
{"category": "Travel Planning & Advice", "task": "I need a two-day Chicago city break focused on art and food."}
{"category": "Travel Planning & Advice", "task": "Help me choose the best time and itinerary for a road trip across New Zealand’s South Island."}
{"category": "Travel Planning & Advice", "task": "Plan a budget-friendly 4-day trip to Lisbon in late spring."}
{"category": "Travel Planning & Advice", "task": "Find the fastest and cheapest way to get from Chicago to Montreal next weekend."}
{"category": "Travel Planning & Advice", "task": "Create a two-week itinerary for a road trip through the Scottish Highlands."}
{"category": "Travel Planning & Advice", "task": "Recommend family-friendly places to stay and things to do in Sydney in December."}
{"category": "Travel Planning & Advice", "task": "Advise on visas, vaccinations, and a packing list for a month in Southeast Asia."}
{"category": "Travel Planning & Advice", "task": "I want to plan a weekend getaway to Lisbon in early spring."}
{"category": "Travel Planning & Advice", "task": "Help me find budget-friendly direct flights to Vancouver from Chicago for the first week of December."}
{"category": "Travel Planning & Advice", "task": "I need a 10-day itinerary in New Zealand focused on outdoor adventures and scenic drives."}
{"category": "Travel Planning & Advice", "task": "Assist me in finding family-friendly accommodations near Bali beaches for mid-summer."}
{"category": "Travel Planning & Advice", "task": "I’d like a city-hopping rail itinerary across Germany for late September."}
{"category": "Travel Planning & Advice", "task": "I want to plan a long weekend getaway to Lisbon next month."}
{"category": "Travel Planning & Advice", "task": "Help me find the best budget-friendly route to Bali from Los Angeles in early spring."}
{"category": "Travel Planning & Advice", "task": "I need help choosing between Marrakech and Athens for a 5-day cultural trip."}
{"category": "Travel Planning & Advice", "task": "I’d like a two-week Southeast Asia itinerary focused on beaches and street food."}
{"category": "Travel Planning & Advice", "task": "I need recommendations for eco-conscious lodging and transport for a road trip through the Scottish Highlands."}
{"category": "Travel Planning & Advice", "task": "Help me plan a long weekend getaway to Lisbon in early spring."}
{"category": "Travel Planning & Advice", "task": "Find the cheapest nonstop flights to Vancouver from my nearest major airport next month."}
{"category": "Travel Planning & Advice", "task": "Suggest a 5-day road trip itinerary around the Scottish Highlands."}
{"category": "Travel Planning & Advice", "task": "Recommend family-friendly beach resorts in the Caribbean for mid-winter."}
{"category": "Travel Planning & Advice", "task": "Advise me on visa and vaccination requirements for a two-week trip to Kenya this fall."}
{"category": "Travel Planning & Advice", "task": "I need a 4-day itinerary for a coastal road trip in Portugal."}
{"category": "Travel Planning & Advice", "task": "Help me decide the best month to visit Iceland to see the northern lights on a mid-range budget."}
{"category": "Travel Planning & Advice", "task": "I want recommendations for kid-friendly, central accommodations in Barcelona in early spring."}
{"category": "Travel Planning & Advice", "task": "I need a comparison of rail passes versus individual tickets for a two-week trip across Germany."}
{"category": "Travel Planning & Advice", "task": "I want a three-day food-focused getaway in Seoul with minimal walking."}
{"category": "Travel Planning & Advice", "task": "Plan a 6-day itinerary for Iceland focused on scenic drives and hot springs."}
{"category": "Travel Planning & Advice", "task": "Find the cheapest multi-city flights from Chicago to London and Rome in late spring."}
{"category": "Travel Planning & Advice", "task": "Recommend kid-friendly activities and mid-range hotels in San Diego for a long weekend."}
{"category": "Travel Planning & Advice", "task": "Suggest a two-week Spain rail itinerary highlighting smaller towns and nature."}
{"category": "Travel Planning & Advice", "task": "Compare travel insurance options for a backpacking trip across South America starting next month."}
{"category": "Travel Planning & Advice", "task": "Plan a long weekend getaway to Lisbon next month."}
{"category": "Travel Planning & Advice", "task": "Help me choose a scenic train route across Switzerland in spring."}
{"category": "Travel Planning & Advice", "task": "Find budget-friendly direct flights to Bangkok from Los Angeles for early December."}
{"category": "Travel Planning & Advice", "task": "Suggest eco-conscious stays and activities for a family trip to Costa Rica."}
{"category": "Travel Planning & Advice", "task": "Create a two-week island-hopping itinerary in Greece focused on beaches and local food."}
{"category": "Travel Planning & Advice", "task": "Plan a budget-friendly two-week backpacking route for me through Eastern Europe."}
{"category": "Travel Planning & Advice", "task": "Help me find the best island-hopping options in Greece for late summer."}
{"category": "Travel Planning & Advice", "task": "Suggest a 5-day scenic road trip in California for me."}
{"category": "Travel Planning & Advice", "task": "Advise me on visas, vaccinations, and travel insurance for a trip to Southeast Asia."}
{"category": "Travel Planning & Advice", "task": "Find remote-work-friendly stays with reliable Wi‑Fi for a month in Portugal for me."}
{"category": "Travel Planning & Advice", "task": "Plan a 5-day trip to Lisbon on a modest budget."}
{"category": "Travel Planning & Advice", "task": "Find the fastest train routes between London, Paris, and Amsterdam next month."}
{"category": "Travel Planning & Advice", "task": "Suggest a two-week itinerary across Southeast Asia with minimal flights."}
{"category": "Travel Planning & Advice", "task": "Help me choose a quiet beach destination in Spain for early June."}
{"category": "Travel Planning & Advice", "task": "Plan a 7-day road trip in the Pacific Northwest with scenic stops."}
{"category": "Travel Planning & Advice", "task": "Plan a long-weekend itinerary for Lisbon in late spring."}
{"category": "Travel Planning & Advice", "task": "Find the most affordable round-trip flights to Barcelona from Chicago next month."}
{"category": "Travel Planning & Advice", "task": "Recommend mid-range hotels near Banff National Park for early summer."}
{"category": "Travel Planning & Advice", "task": "Outline a 10-day road trip through New Zealand’s South Island."}
{"category": "Travel Planning & Advice", "task": "Advise on the best time to visit Patagonia and suggest a simple two-week route."}
{"category": "Travel Planning & Advice", "task": "Help me plan a long weekend in Lisbon next month."}
{"category": "Travel Planning & Advice", "task": "Find convenient train routes and passes for a week in Switzerland."}
{"category": "Travel Planning & Advice", "task": "Create a budget-friendly 10-day itinerary for Vietnam."}
{"category": "Travel Planning & Advice", "task": "Suggest a quiet Caribbean beach destination with affordable stays for early spring."}
{"category": "Travel Planning & Advice", "task": "Compare flight and hotel options for a family trip to Vancouver in late summer."}
{"category": "Travel Planning & Advice", "task": "Plan a two-week backpacking route through Southeast Asia on a modest budget."}
{"category": "Travel Planning & Advice", "task": "Help me find the best time and places to see the Northern Lights in Iceland this winter."}
{"category": "Travel Planning & Advice", "task": "Suggest a 5-day road trip in the Pacific Northwest with scenic stops and affordable stays."}
{"category": "Travel Planning & Advice", "task": "Compare family-friendly all-inclusive beach resorts in Mexico for a trip next school break."}
{"category": "Travel Planning & Advice", "task": "Help me choose the cheapest and most convenient way to travel between London, Paris, and Amsterdam."}
{"category": "Travel Planning & Advice", "task": "I want a budget-friendly long weekend plan in Lisbon this spring."}
{"category": "Travel Planning & Advice", "task": "I need the fastest train options from Berlin to Prague for next Friday."}
{"category": "Travel Planning & Advice", "task": "I’m looking for family-friendly coastal towns in Spain for a June holiday."}
{"category": "Travel Planning & Advice", "task": "I want a 10-day Southeast Asia itinerary focusing on nature and food."}
{"category": "Travel Planning & Advice", "task": "I need the best time and route for a road trip from San Francisco to Vancouver."}
{"category": "Travel Planning & Advice", "task": "I want a 3-day city break plan for a coastal city in Spain next month."}
{"category": "Travel Planning & Advice", "task": "Find budget-friendly flights and stays for a 4-day trip to Vancouver in early spring."}
{"category": "Travel Planning & Advice", "task": "Help me choose between Lisbon and Porto for a short trip, with pros and cons and a simple plan."}
{"category": "Travel Planning & Advice", "task": "Plan a road trip route in Italy focused on scenic towns and food."}
{"category": "Travel Planning & Advice", "task": "Suggest off-season destinations in Southeast Asia for a two-week trip with rough costs."}
{"category": "Travel Planning & Advice", "task": "I want a three-day weekend getaway plan to Lisbon this spring."}
{"category": "Travel Planning & Advice", "task": "I need budget-friendly boutique hotel options in Reykjavik near the airport."}
{"category": "Travel Planning & Advice", "task": "I want a five-day road trip itinerary along the California coast."}
{"category": "Travel Planning & Advice", "task": "I need a comparison of train vs flight from Berlin to Prague next month."}
{"category": "Travel Planning & Advice", "task": "I want a quiet Greek island escape suggestion for early summer with light crowds."}
{"category": "Travel Planning & Advice", "task": "Help me plan a 10-day road trip through the Pacific Northwest next spring."}
{"category": "Travel Planning & Advice", "task": "Find budget-friendly places to stay in Lisbon for a long weekend near public transit."}
{"category": "Travel Planning & Advice", "task": "Help me compare rail passes and routes for traveling across Italy over two weeks."}
{"category": "Travel Planning & Advice", "task": "Help me design a family-friendly Thailand trip with beaches and cultural activities."}
{"category": "Travel Planning & Advice", "task": "Suggest a late-December Europe getaway with minimal crowds and easy flights from Chicago."}
{"category": "Travel Planning & Advice", "task": "I want a 4-day art-and-food-focused city break plan for Lisbon next month."}
{"category": "Travel Planning & Advice", "task": "Help me find budget-friendly flights from Chicago to Bali in early December."}
{"category": "Travel Planning & Advice", "task": "Recommend family-friendly places to stay near Banff for a spring visit."}
{"category": "Travel Planning & Advice", "task": "I need a two-week public transport itinerary across South Korea with key sights."}
{"category": "Travel Planning & Advice", "task": "Suggest a weekend trip to Marrakech with must-see spots and local tips."}
{"category": "Travel Planning & Advice", "task": "I need help planning a 4-day city break to Lisbon in early spring."}
{"category": "Travel Planning & Advice", "task": "I want you to find budget-friendly train routes for traveling across Italy next month."}
{"category": "Travel Planning & Advice", "task": "I’d like a 10-day Southeast Asia itinerary focused on beaches and street food."}
{"category": "Travel Planning & Advice", "task": "I need suggestions for family-friendly activities and lodging for a week in Vancouver this summer."}
{"category": "Travel Planning & Advice", "task": "I want to compare flights and car rentals to visit Utah’s national parks over a 5-day trip."}
{"category": "Travel Planning & Advice", "task": "I want a 5-day budget-friendly itinerary for Lisbon next month."}
{"category": "Travel Planning & Advice", "task": "Help me plan a scenic road trip from San Francisco to Seattle with three overnight stops."}
{"category": "Travel Planning & Advice", "task": "Find me visa and entry requirements for a two-week trip to Thailand as a U.S. citizen."}
{"category": "Travel Planning & Advice", "task": "Suggest the best neighborhoods to stay in Barcelona for food and nightlife."}
{"category": "Travel Planning & Advice", "task": "Recommend family-friendly, mid-range hotels near Lake Como for early summer."}
{"category": "Travel Planning & Advice", "task": "Plan a three-day city break in Lisbon next month on a modest budget."}
{"category": "Travel Planning & Advice", "task": "Compare overnight train and flight options from Paris to Barcelona next weekend."}
{"category": "Travel Planning & Advice", "task": "Suggest a 7-day scenic road trip in Scotland with affordable stays."}
{"category": "Travel Planning & Advice", "task": "Find the best shoulder-season week to visit Bali this year with rough costs."}
{"category": "Travel Planning & Advice", "task": "Outline entry requirements and a simple 5-day itinerary for a first-time trip to Vietnam."}
{"category": "Travel Planning & Advice", "task": "Plan a 5-day budget-friendly itinerary for Seoul this spring."}
{"category": "Travel Planning & Advice", "task": "Suggest a scenic road-trip route through the Scottish Highlands with rough timing."}
{"category": "Travel Planning & Advice", "task": "Recommend kid-friendly activities and lodging for a family trip to San Diego in July."}
{"category": "Travel Planning & Advice", "task": "Compare train and flight options from Berlin to Prague for next weekend."}
{"category": "Travel Planning & Advice", "task": "Outline visa and entry steps for a two-week trip to Vietnam from the US next month."}
{"category": "Travel Planning & Advice", "task": "Help me plan a long weekend in Lisbon next month."}
{"category": "Travel Planning & Advice", "task": "Help me find the best route and stops for a road trip from San Francisco to Seattle."}
{"category": "Travel Planning & Advice", "task": "Suggest kid-friendly activities and lodging for my week in Orlando."}
{"category": "Travel Planning & Advice", "task": "Compare travel insurance options for my two-week trip to South America."}
{"category": "Travel Planning & Advice", "task": "Tell me the best time to visit Iceland and draft a 5-day itinerary."}
{"category": "Travel Planning & Advice", "task": "I want to plan a budget-friendly long weekend in Lisbon this spring."}
{"category": "Travel Planning & Advice", "task": "I need the best route and stops for a road trip from Los Angeles to the Grand Canyon next month."}
{"category": "Travel Planning & Advice", "task": "Help me choose family-friendly accommodations and activities in Vancouver for a 5-day trip."}
{"category": "Travel Planning & Advice", "task": "I’d like a two-week itinerary for Thailand focused on beaches and local food."}
{"category": "Travel Planning & Advice", "task": "I want to compare train and flight options for a quick trip from Berlin to Amsterdam this weekend."}
{"category": "Travel Planning & Advice", "task": "Help me plan a budget-friendly long weekend in Lisbon next month."}
{"category": "Travel Planning & Advice", "task": "I need to compare train and bus options from Berlin to Prague for this weekend."}
{"category": "Travel Planning & Advice", "task": "Please recommend family-friendly beachfront resorts in Bali for early spring."}
{"category": "Travel Planning & Advice", "task": "Plan a simple 7-day Iceland itinerary focused on nature and light hiking for me."}
{"category": "Travel Planning & Advice", "task": "Tell me the visa and entry requirements for my two-week trip to Vietnam from the US."}
{"category": "Travel Planning & Advice", "task": "I want to plan a budget-friendly 5-day trip to Lisbon next month."}
{"category": "Travel Planning & Advice", "task": "Help me map out a scenic train route across Switzerland in early spring."}
{"category": "Travel Planning & Advice", "task": "I need the best flight and a central hotel for a long weekend in Athens."}
{"category": "Travel Planning & Advice", "task": "Recommend a family-friendly road trip from Los Angeles to the Grand Canyon."}
{"category": "Travel Planning & Advice", "task": "Plan a relaxed two-week island-hopping itinerary in Greece for the summer."}
{"category": "Travel Planning & Advice", "task": "I want a budget-friendly long weekend plan for Lisbon next month."}
{"category": "Travel Planning & Advice", "task": "Help me find the best multi-city flights and route for two weeks in Southeast Asia."}
{"category": "Travel Planning & Advice", "task": "I need kid-friendly activities and a 4-day itinerary for Orlando."}
{"category": "Travel Planning & Advice", "task": "Recommend scenic train routes and a flexible plan for me to travel across Switzerland."}
{"category": "Travel Planning & Advice", "task": "Compare travel insurance options for my two-week adventure trip to Patagonia."}
{"category": "Travel Planning & Advice", "task": "I would like a budget-friendly weekend getaway plan for Lisbon next month."}
{"category": "Travel Planning & Advice", "task": "I need a two-week road trip route across the Scottish Highlands with scenic stops."}
{"category": "Travel Planning & Advice", "task": "Help me find family-friendly accommodations and activities in Bali for early spring."}
{"category": "Travel Planning & Advice", "task": "I'd like a three-day itinerary focused on food and art in Mexico City."}
{"category": "Travel Planning & Advice", "task": "I want recommendations for off-the-beaten-path beaches and lodging in Sardinia for late summer."}
{"category": "Travel Planning & Advice", "task": "Plan a 5-day trip to Lisbon next month."}
{"category": "Travel Planning & Advice", "task": "Find the cheapest transport options from Seattle to Vancouver soon."}
{"category": "Travel Planning & Advice", "task": "Recommend kid-friendly places to stay in Kyoto for a short visit."}
{"category": "Travel Planning & Advice", "task": "Outline a two-week backpacking route across northern Spain."}
{"category": "Travel Planning & Advice", "task": "Suggest a budget-friendly winter ski weekend in the Alps."}
{"category": "Travel Planning & Advice", "task": "Help me plan a budget-friendly weekend getaway to Lisbon next month."}
{"category": "Travel Planning & Advice", "task": "Find the best time to visit Iceland for the northern lights and suggest a 5-day plan."}
{"category": "Travel Planning & Advice", "task": "Compare train vs flight options for traveling from Berlin to Prague next week."}
{"category": "Travel Planning & Advice", "task": "Recommend family-friendly activities and lodging for a trip to San Diego this spring."}
{"category": "Travel Planning & Advice", "task": "Create a flexible two-week itinerary for Thailand focusing on beaches and cultural sites."}
{"category": "Travel Planning & Advice", "task": "Help me plan a 5-day city break in Lisbon with key sights and local food."}
{"category": "Travel Planning & Advice", "task": "I need the cheapest round-trip flights from Chicago to Vancouver next month."}
{"category": "Travel Planning & Advice", "task": "Find cozy places to stay near the Amalfi Coast for early autumn."}
{"category": "Travel Planning & Advice", "task": "Compare train and flight options from London to Edinburgh for a weekend."}
{"category": "Travel Planning & Advice", "task": "Tell me the best time to visit Bali and sketch a simple 7-day route."}
{"category": "Travel Planning & Advice", "task": "Help me plan a budget-friendly road trip along the California coast next month."}
{"category": "Travel Planning & Advice", "task": "Find the best off-season beach getaway options in Portugal for early spring."}
{"category": "Travel Planning & Advice", "task": "Suggest a 10-day rail itinerary across Central Europe starting in Munich."}
{"category": "Travel Planning & Advice", "task": "Help me choose family-friendly activities and lodging for a weekend in Vancouver."}
{"category": "Travel Planning & Advice", "task": "Advise me on flights and visa requirements for a two-week trip to Vietnam in winter."}
{"category": "Travel Planning & Advice", "task": "Plan a long weekend getaway to Lisbon with a mix of culture and food."}
{"category": "Travel Planning & Advice", "task": "Find budget-friendly flights and accommodations for a two-week Southeast Asia trip in December."}
{"category": "Travel Planning & Advice", "task": "Create a road trip route through the Scottish Highlands with scenic stops."}
{"category": "Travel Planning & Advice", "task": "Recommend kid-friendly activities and lodging for a family vacation in Costa Rica."}
{"category": "Travel Planning & Advice", "task": "Suggest a 10-day itinerary in Greece focused on islands and historic sites."}
{"category": "Travel Planning & Advice", "task": "Help me plan a budget-friendly weekend getaway to a coastal city in Spain."}
{"category": "Travel Planning & Advice", "task": "Find me the best multi-city flight options for a two-week Europe trip in early spring."}
{"category": "Travel Planning & Advice", "task": "Recommend family-friendly places to stay near a major theme park in Florida."}
{"category": "Travel Planning & Advice", "task": "Create a 5-day road-trip itinerary to explore national parks in the Pacific Northwest."}
{"category": "Travel Planning & Advice", "task": "Suggest off-the-beaten-path day trips I can take from Lisbon using public transport."}
{"category": "Travel Planning & Advice", "task": "I need help planning a budget-friendly long weekend in Lisbon."}
{"category": "Travel Planning & Advice", "task": "I want the best time and rough costs for a two-week trip to New Zealand next year."}
{"category": "Travel Planning & Advice", "task": "I’d like family-friendly hotels and a simple 4-day itinerary in Orlando without theme parks."}
{"category": "Travel Planning & Advice", "task": "I need a comparison of train vs flight options from Berlin to Prague next month."}
{"category": "Travel Planning & Advice", "task": "I want a packing list and weather overview for a spring trip to Seoul."}
{"category": "Travel Planning & Advice", "task": "Plan a budget-friendly 4-day weekend in Lisbon this spring."}
{"category": "Travel Planning & Advice", "task": "Suggest a scenic train itinerary across Switzerland for one week in May."}
{"category": "Travel Planning & Advice", "task": "Compare family-friendly beach resort options in the Algarve for late June."}
{"category": "Travel Planning & Advice", "task": "Map out a road trip from Seattle to Banff with camping stops in late summer."}
{"category": "Travel Planning & Advice", "task": "Advise on visas and vaccinations for a two-week trip to Vietnam this summer."}
{"category": "Travel Planning & Advice", "task": "I want a two-week budget-friendly backpacking route across Portugal and Spain."}
{"category": "Travel Planning & Advice", "task": "I need the best time and places to see the northern lights in Iceland this winter."}
{"category": "Travel Planning & Advice", "task": "I want a family-friendly long weekend itinerary in Vancouver with outdoor activities."}
{"category": "Travel Planning & Advice", "task": "I need a comparison of train vs. bus options between Zurich, Milan, and Venice next month."}
{"category": "Travel Planning & Advice", "task": "I want eco-conscious accommodations and local transport tips for a week in Bali."}
{"category": "Travel Planning & Advice", "task": "Plan a 9-day island-hopping itinerary in Greece for early summer."}
{"category": "Travel Planning & Advice", "task": "Find budget-friendly multi-city flights and a simple route for a 10-day trip to London, Amsterdam, and Berlin."}
{"category": "Travel Planning & Advice", "task": "Recommend sustainable stays and key activities for a long weekend in Costa Rica this winter."}
{"category": "Travel Planning & Advice", "task": "Outline a train-focused itinerary across Switzerland for five days with scenic stops."}
{"category": "Travel Planning & Advice", "task": "Advise on visas, health prep, and packing for a two-week trek in Peru during the dry season."}
{"category": "Travel Planning & Advice", "task": "I need a budget-friendly 7-day itinerary for Lisbon and Porto next month."}
{"category": "Travel Planning & Advice", "task": "Help me find flexible multi-city flights for a two-week trip through Spain and Italy this summer."}
{"category": "Travel Planning & Advice", "task": "I want a kid-friendly long weekend plan for Vancouver with indoor options in case of rain."}
{"category": "Travel Planning & Advice", "task": "Advise me on visa and entry requirements and a simple route for a two-week trip to Vietnam and Cambodia."}
{"category": "Travel Planning & Advice", "task": "Recommend eco-friendly hotels and transport for a May trip to Costa Rica."}
{"category": "Travel Planning & Advice", "task": "I would like to plan a budget-friendly 4-day trip to Lisbon."}
{"category": "Travel Planning & Advice", "task": "Help me choose between train or flight from Berlin to Vienna next weekend."}
{"category": "Travel Planning & Advice", "task": "Help me find family-friendly beachfront accommodations in Bali for early spring."}
{"category": "Travel Planning & Advice", "task": "I want to plan a scenic road trip through the Scottish Highlands."}
{"category": "Travel Planning & Advice", "task": "Suggest a two-week Southeast Asia itinerary with minimal flights for me."}
{"category": "Travel Planning & Advice", "task": "I want to plan a budget-friendly long weekend in Lisbon next month."}
{"category": "Travel Planning & Advice", "task": "Help me figure out the best scenic train route across Switzerland in early spring."}
{"category": "Travel Planning & Advice", "task": "Plan a flexible two-week backpacking itinerary through Southeast Asia."}
{"category": "Travel Planning & Advice", "task": "Find pet-friendly beach stays and simple plans for a short getaway near San Diego."}
{"category": "Travel Planning & Advice", "task": "Advise me on a Northern Lights trip to Tromsø this winter with suggested timing."}
{"category": "Travel Planning & Advice", "task": "Help me plan a two-week backpacking route across Southeast Asia on a tight budget."}
{"category": "Travel Planning & Advice", "task": "Find me the best multi-city flight options for a spring trip in Europe with flexible dates."}
{"category": "Travel Planning & Advice", "task": "I need a simple 4-day beginner-friendly ski itinerary for a family getaway."}
{"category": "Travel Planning & Advice", "task": "Recommend calm, walkable neighborhoods and mid-range stays for a workation in Lisbon."}
{"category": "Travel Planning & Advice", "task": "Compare a few Greek islands for a quiet beach trip and sketch a 6-day plan for me."}
{"category": "Travel Planning & Advice", "task": "I need help planning a 4-day weekend getaway to Lisbon this fall with a rough budget and highlights."}
{"category": "Travel Planning & Advice", "task": "Help me find the best-value nonstop flights to Barcelona from Chicago in late April."}
{"category": "Travel Planning & Advice", "task": "Please suggest a 10-day Thailand itinerary focusing on beaches and culture with realistic travel times."}
{"category": "Travel Planning & Advice", "task": "Advise me on visa and entry requirements for my two-week trip to Vietnam next month."}
{"category": "Travel Planning & Advice", "task": "Recommend eco-friendly stays and a simple route for my road trip around the Scottish Highlands in early summer."}
{"category": "Travel Planning & Advice", "task": "I want help planning a long weekend trip to Lisbon next month."}
{"category": "Travel Planning & Advice", "task": "I need budget-friendly stays near Banff National Park for early spring."}
{"category": "Travel Planning & Advice", "task": "I’d like to compare overnight train options from Berlin to Vienna for early December."}
{"category": "Travel Planning & Advice", "task": "I want a two-week Southeast Asia itinerary focused on beaches and culture."}
{"category": "Travel Planning & Advice", "task": "I need advice on the best time and route for a road trip through the Scottish Highlands."}
{"category": "Travel Planning & Advice", "task": "I need a budget-friendly long weekend plan for Lisbon this spring."}
{"category": "Travel Planning & Advice", "task": "I want to see the Northern Lights in Norway this winter; advise on timing and locations."}
{"category": "Travel Planning & Advice", "task": "Help me map a two-week Southeast Asia itinerary across three cities."}
{"category": "Travel Planning & Advice", "task": "Recommend kid-friendly activities and stays for a week in Vancouver next month."}
{"category": "Travel Planning & Advice", "task": "I want a scenic train route and schedule from Zurich to Milan."}
{"category": "Travel Planning & Advice", "task": "Plan a 6-day itinerary for Barcelona centered on art museums and tapas."}
{"category": "Travel Planning & Advice", "task": "Find the cheapest nonstop flights to Athens from Chicago in early December."}
{"category": "Travel Planning & Advice", "task": "Recommend family-friendly seaside stays near the Amalfi Coast for late spring."}
{"category": "Travel Planning & Advice", "task": "Map a two-week Southeast Asia route with minimal flights and a rough daily budget."}
{"category": "Travel Planning & Advice", "task": "Plan a scenic public-transit itinerary around the Scottish Highlands in October."}
{"category": "Travel Planning & Advice", "task": "I want to plan a budget-friendly weekend trip to Lisbon next month."}
{"category": "Travel Planning & Advice", "task": "Help me compare train vs. flight options between Berlin and Prague in early December."}
{"category": "Travel Planning & Advice", "task": "I need a 7-day road trip route in the Pacific Northwest with scenic stops."}
{"category": "Travel Planning & Advice", "task": "Assist me in finding family-friendly beachfront hotels in Bali for late spring."}
{"category": "Travel Planning & Advice", "task": "I want a 4-day Iceland itinerary focused on seeing the northern lights."}
{"category": "Travel Planning & Advice", "task": "I want to plan a 5-day trip to Lisbon next month."}
{"category": "Travel Planning & Advice", "task": "I need the cheapest flights from Chicago to Athens in early June."}
{"category": "Travel Planning & Advice", "task": "I want a one-week road trip route through the Scottish Highlands."}
{"category": "Travel Planning & Advice", "task": "I need a winter itinerary to see the Northern Lights in Iceland."}
{"category": "Travel Planning & Advice", "task": "I want advice on visas and vaccinations for a two-week trip to Kenya this summer."}
{"category": "Travel Planning & Advice", "task": "Plan a long weekend getaway to Lisbon with a focus on local food and neighborhoods."}
{"category": "Travel Planning & Advice", "task": "Find the best budget-friendly route and timing for a two-week Europe rail trip next spring."}
{"category": "Travel Planning & Advice", "task": "Suggest a family-friendly itinerary for a beach vacation in Costa Rica."}
{"category": "Travel Planning & Advice", "task": "Help me choose a mountain lodge in Switzerland for a winter trip."}
{"category": "Travel Planning & Advice", "task": "Plan a scenic road trip through the Pacific Northwest with short hikes and viewpoints."}
{"category": "Travel Planning & Advice", "task": "Help me plan a budget-friendly weekend getaway to Lisbon next month."}
{"category": "Travel Planning & Advice", "task": "I need a 5-day scenic train itinerary across Switzerland."}
{"category": "Travel Planning & Advice", "task": "Help me find the cheapest non-stop flights to Athens for a short trip soon."}
{"category": "Travel Planning & Advice", "task": "Suggest quiet, walkable neighborhoods to stay in Barcelona for a week."}
{"category": "Travel Planning & Advice", "task": "I need to know visa and vaccination requirements for my two-week trip to Kenya."}
{"category": "Travel Planning & Advice", "task": "I need a 4-day itinerary for Lisbon that balances culture and relaxation."}
{"category": "Travel Planning & Advice", "task": "Help me find affordable, well-rated hostels in Seoul for mid-December."}
{"category": "Travel Planning & Advice", "task": "I want to plan a scenic road trip from San Francisco to San Diego with coastal stops."}
{"category": "Travel Planning & Advice", "task": "Find me the best month to visit Iceland for northern lights and a sample budget."}
{"category": "Travel Planning & Advice", "task": "Suggest family-friendly activities and hotels for a week in Vancouver."}
{"category": "Travel Planning & Advice", "task": "I want a weekend getaway plan to Lisbon focusing on affordable food and local neighborhoods."}
{"category": "Travel Planning & Advice", "task": "I need the best time and budget-friendly route for a two-week trip around New Zealand’s South Island."}
{"category": "Travel Planning & Advice", "task": "I would like kid-friendly activities and a simple itinerary for a 3-day visit to San Diego."}
{"category": "Travel Planning & Advice", "task": "I want to compare overnight train options and lodging for a Berlin to Prague trip next month."}
{"category": "Travel Planning & Advice", "task": "Help me choose between Bali and Phuket for a seven-day beach trip, including estimated costs."}
{"category": "Travel Planning & Advice", "task": "Help me plan a budget-friendly long weekend in Lisbon."}
{"category": "Travel Planning & Advice", "task": "Find the best multi-city route and transport options for two weeks across Spain and Portugal."}
{"category": "Travel Planning & Advice", "task": "Recommend family-friendly accommodations and activities in Vancouver for early spring."}
{"category": "Travel Planning & Advice", "task": "Suggest a 10-day itinerary in Greece emphasizing islands and local food."}
{"category": "Travel Planning & Advice", "task": "Advise on visa, rail passes, and packing essentials for a solo winter trip across Eastern Europe."}
{"category": "Travel Planning & Advice", "task": "I want a 4-day itinerary in Lisbon focused on local food and viewpoints."}
{"category": "Travel Planning & Advice", "task": "Help me pick a budget-friendly beach destination in Southeast Asia for next month."}
{"category": "Travel Planning & Advice", "task": "Find the best time to visit Patagonia for hiking and outline a 6-day plan."}
{"category": "Travel Planning & Advice", "task": "Plan a scenic road trip through the Scottish Highlands for one week."}
{"category": "Travel Planning & Advice", "task": "Advise me on visa and vaccination essentials for a 10-day trip to Kenya."}
{"category": "Travel Planning & Advice", "task": "I want a simple 5-day itinerary for Lisbon with an emphasis on local food."}
{"category": "Travel Planning & Advice", "task": "I need the cheapest multi-city flights for a two-week trip around Southeast Asia next month."}
{"category": "Travel Planning & Advice", "task": "Help me find family-friendly, mid-range hotels near Lake Como for early summer."}
{"category": "Travel Planning & Advice", "task": "I’d like a weekend getaway plan to a warm European city with good public transport."}
{"category": "Travel Planning & Advice", "task": "Help me plan a 7-day national parks road trip in the U.S. with light hiking and scenic stops."}
{"category": "Travel Planning & Advice", "task": "I want to plan a 5-day budget trip to Lisbon next spring."}
{"category": "Travel Planning & Advice", "task": "Help me find the cheapest non-stop flights from Chicago to San Francisco for the first weekend of next month."}
{"category": "Travel Planning & Advice", "task": "I want a two-week Southeast Asia itinerary mixing beaches and culture."}
{"category": "Travel Planning & Advice", "task": "Help me pick family-friendly mid-range hotels in Barcelona near major sights."}
{"category": "Travel Planning & Advice", "task": "Advise me on visas, vaccinations, and travel insurance for a two-week trip to Kenya."}
{"category": "Travel Planning & Advice", "task": "I want a 3-day city break in Lisbon with budget tips."}
{"category": "Travel Planning & Advice", "task": "I need help choosing the best month to see the Northern Lights in Iceland and a simple 4-day plan."}
{"category": "Travel Planning & Advice", "task": "I want to compare train vs. flight from Berlin to Prague next month and pick the better option."}
{"category": "Travel Planning & Advice", "task": "I need a 5-day family-friendly itinerary with hotel ideas for Orlando."}
{"category": "Travel Planning & Advice", "task": "I want a minimalist packing list and a flexible two-week backpacking route for Southeast Asia."}
{"category": "Travel Planning & Advice", "task": "Plan a budget-friendly 4-day city break in Lisbon next month."}
{"category": "Travel Planning & Advice", "task": "Recommend a scenic road trip route through the Scottish Highlands for a long weekend."}
{"category": "Travel Planning & Advice", "task": "Compare flight and lodging options for a week in Mexico City, with a simple daily plan."}
{"category": "Travel Planning & Advice", "task": "Outline a 10-day itinerary for Iceland focused on nature and hot springs."}
{"category": "Travel Planning & Advice", "task": "Advise on visas, vaccinations, and a basic 7-day safari plan for Kenya in July."}
{"category": "Travel Planning & Advice", "task": "Help me plan a five-day trip to Seoul with a focus on food and culture."}
{"category": "Travel Planning & Advice", "task": "Find affordable flights and a hotel for a long weekend in Vancouver."}
{"category": "Travel Planning & Advice", "task": "Suggest a scenic road trip itinerary along the Amalfi Coast."}
{"category": "Travel Planning & Advice", "task": "Recommend family-friendly resorts in Bali for next spring."}
{"category": "Travel Planning & Advice", "task": "Advise me on the best time to visit Patagonia and outline a simple itinerary."}
{"category": "Travel Planning & Advice", "task": "Plan a long-weekend itinerary for Lisbon and Porto next month."}
{"category": "Travel Planning & Advice", "task": "Find the cheapest non-stop flights from Chicago to Cancun in early December."}
{"category": "Travel Planning & Advice", "task": "Recommend mid-range, pet-friendly hotels near Banff National Park this winter."}
{"category": "Travel Planning & Advice", "task": "Compare train versus flight options from London to Edinburgh next weekend."}
{"category": "Travel Planning & Advice", "task": "Outline a two-week road trip plan for New Zealand’s South Island in spring."}
{"category": "Travel Planning & Advice", "task": "I need a 4-day itinerary for Lisbon with budget-friendly food and sights."}
{"category": "Travel Planning & Advice", "task": "I want advice on the best month to visit Iceland and a simple 5-day road trip outline."}
{"category": "Travel Planning & Advice", "task": "I need kid-friendly hotels and activities around Lake Como for early summer."}
{"category": "Travel Planning & Advice", "task": "I need the cheapest way to travel from London to Edinburgh next weekend."}
{"category": "Travel Planning & Advice", "task": "I want a two-week backpacking route across Vietnam and Cambodia with basic visa tips."}
{"category": "Travel Planning & Advice", "task": "I need help planning a budget-friendly weekend getaway to Barcelona next month."}
{"category": "Travel Planning & Advice", "task": "I want the best multi-city route for a two-week trip across Thailand and Vietnam."}
{"category": "Travel Planning & Advice", "task": "I'd like a 5-day itinerary in Lisbon focused on art and local food."}
{"category": "Travel Planning & Advice", "task": "I need affordable, pet-friendly stays near Banff for early spring."}
{"category": "Travel Planning & Advice", "task": "I want to compare overnight train options between Paris and Berlin for next week."}
{"category": "Travel Planning & Advice", "task": "Plan a long weekend itinerary in Lisbon focused on food and neighborhoods."}
{"category": "Travel Planning & Advice", "task": "Find budget-friendly flights to Bali in early spring."}
{"category": "Travel Planning & Advice", "task": "Recommend family-friendly hotels near the theme parks in Orlando for a short stay."}
{"category": "Travel Planning & Advice", "task": "Outline a two-week itinerary across Vietnam using trains and buses."}
{"category": "Travel Planning & Advice", "task": "Advise on visa and entry requirements for a trip to Morocco next month."}
{"category": "Travel Planning & Advice", "task": "Help me choose the best time to visit Iceland for the Northern Lights and outline a 4-day plan."}
{"category": "Travel Planning & Advice", "task": "I want a budget-friendly five-day road trip plan along the California coast with scenic stops."}
{"category": "Travel Planning & Advice", "task": "Find the easiest train routes and passes for me to visit Berlin, Prague, and Vienna next month."}
{"category": "Travel Planning & Advice", "task": "I need family-friendly resort options and a simple 3-day itinerary for Bali."}
{"category": "Travel Planning & Advice", "task": "Advise me on visas, vaccines, and a basic packing list for a two-week trip to Kenya."}
{"category": "Travel Planning & Advice", "task": "Plan a 5-day budget trip to Lisbon focused on local neighborhoods and food."}
{"category": "Travel Planning & Advice", "task": "Compare train and flight options from Berlin to Prague next month and suggest the best choice."}
{"category": "Travel Planning & Advice", "task": "Plan an EV-friendly road trip from Seattle to San Francisco with scenic stops and charging points."}
{"category": "Travel Planning & Advice", "task": "Help me choose the best time of year to visit Bali based on weather and crowds."}
{"category": "Travel Planning & Advice", "task": "Find family-friendly all-inclusive resorts in Cancun for a spring break getaway."}
{"category": "Travel Planning & Advice", "task": "Plan a budget-friendly weekend getaway to Lisbon next month."}
{"category": "Travel Planning & Advice", "task": "Find the best time and route for a road trip from Los Angeles to Seattle."}
{"category": "Travel Planning & Advice", "task": "Compare family-friendly resorts in Bali for a five-day stay during the rainy season."}
{"category": "Travel Planning & Advice", "task": "Create a two-week itinerary across Spain using only trains."}
{"category": "Travel Planning & Advice", "task": "Suggest a minimalist packing list and travel tips for a winter trip to Reykjavik."}
{"category": "Travel Planning & Advice", "task": "Plan a 5-day budget-friendly itinerary for Lisbon focusing on local food and culture."}
{"category": "Travel Planning & Advice", "task": "Find the best time to visit Iceland for northern lights and suggest a simple 4-day plan."}
{"category": "Travel Planning & Advice", "task": "Compare train and flight options for a weekend trip from Berlin to Prague and suggest a simple plan."}
{"category": "Travel Planning & Advice", "task": "Recommend family-friendly, pet-friendly accommodations near Lake Tahoe for a winter getaway."}
{"category": "Travel Planning & Advice", "task": "Help me plan a two-week Southeast Asia route with rough costs and basic visa notes."}
{"category": "Travel Planning & Advice", "task": "I need a budget-friendly weekend getaway plan for Barcelona next month."}
{"category": "Travel Planning & Advice", "task": "I want the best multi-city route for a two-week Europe trip starting in Amsterdam."}
{"category": "Travel Planning & Advice", "task": "I need recommendations for family-friendly resorts in Bali for early spring."}
{"category": "Travel Planning & Advice", "task": "I want a 5-day itinerary in Vancouver focused on nature and local food."}
{"category": "Travel Planning & Advice", "task": "I need a comparison of train and flight options from London to Edinburgh for next Friday."}
{"category": "Travel Planning & Advice", "task": "I need help planning a budget-friendly weekend in Lisbon next month."}
{"category": "Travel Planning & Advice", "task": "I want the best time and route for a two-week road trip through the Scottish Highlands."}
{"category": "Travel Planning & Advice", "task": "I’d like a 5-day island-hopping itinerary in Greece with ferry options."}
{"category": "Travel Planning & Advice", "task": "I need kid-friendly activities and lodging for a spring break trip to San Diego."}
{"category": "Travel Planning & Advice", "task": "I want a simple itinerary with visa, vaccination, and cost guidance for a two-country trip in Southeast Asia."}
{"category": "Travel Planning & Advice", "task": "I want a long-weekend getaway plan to Lisbon that balances culture and food."}
{"category": "Travel Planning & Advice", "task": "I need budget-friendly places to stay and ways to get around for a family trip to Vancouver next month."}
{"category": "Travel Planning & Advice", "task": "I’d like a two-week Greek islands itinerary focused on beaches and easy ferry routes."}
{"category": "Travel Planning & Advice", "task": "Help me figure out the best time and route for a road trip from Chicago to the Grand Canyon."}
{"category": "Travel Planning & Advice", "task": "I want eco-friendly stays and activities for a winter trip to Iceland."}
{"category": "Travel Planning & Advice", "task": "Help me plan a long weekend getaway to Lisbon in early spring."}
{"category": "Travel Planning & Advice", "task": "Find budget-friendly, well-rated hostels near Petra for a short stay."}
{"category": "Travel Planning & Advice", "task": "Suggest a two-week road trip route across Scotland with scenic stops."}
{"category": "Travel Planning & Advice", "task": "Compare train and flight options from Berlin to Prague next month."}
{"category": "Travel Planning & Advice", "task": "Recommend safe neighborhoods and mid-range hotels in Mexico City for a solo traveler."}
